In [38]:
import numpy as np
import pandas as pd

In [39]:
df=pd.DataFrame(np.random.randn(20).reshape(5,4))
display(df)
sampler=np.random.permutation(2)
#display(sampler)
df.take(sampler)

          0         1         2         3
0  0.659980  0.715626  0.005596  1.575313
1 -1.555723  1.336870  0.028397 -0.098563
2  0.509854 -0.711777 -0.090198 -0.045102
3 -1.327158  0.064766  0.864809 -0.565093
4 -0.202205 -0.344702  0.111228 -1.339892

          0         1         2         3
1 -1.555723  1.336870  0.028397 -0.098563
0  0.659980  0.715626  0.005596  1.575313

In [40]:
df.sample(3,replace=True)

          0         1         2         3
0  0.659980  0.715626  0.005596  1.575313
3 -1.327158  0.064766  0.864809 -0.565093
3 -1.327158  0.064766  0.864809 -0.565093

In [41]:
df.sample(3,replace=False)

          0         1         2         3
0  0.659980  0.715626  0.005596  1.575313
2  0.509854 -0.711777 -0.090198 -0.045102
3 -1.327158  0.064766  0.864809 -0.565093

In [46]:
df1 = pd.DataFrame({'Name':['Umer','Bilal','Ali','Usman'],
                   'age':(np.random.randn(4))}).set_index('Name')
df1

            age
Name
Umer  -1.092623
Bilal  2.632297
Ali   -0.616949
Usman -1.211652

In [47]:
df2 = pd.DataFrame({'SName':['Umer','Bilal','Ali','Hamza'],
                   'GPA':(np.random.randn(4))})
df2

   SName       GPA
0   Umer -0.503088
1  Bilal -0.330056
2    Ali  0.524174
3  Hamza  0.193307

In [48]:
df1.join(df2)

            age SName  GPA
Name
Umer  -1.092623   NaN  NaN
Bilal  2.632297   NaN  NaN
Ali   -0.616949   NaN  NaN
Usman -1.211652   NaN  NaN

# Heirarchical Indexing

In [49]:
df=pd.Series(np.random.randn(10),
            index = [['Karachi','Karachi'
                     ,'Karachi','Karachi',
                     'lahore','lahore','lahore',
                     "Islamabad","Peshawar",'Peshawar'],
                    ['Dhoraji','Sharfabad','Tariq Road', 'Defence',
                    'Gulberg','Iqbal Road','Model Town',
                    'F-9','Khyber','Qissa Khuwani Bazar']])

In [50]:
df

Karachi    Dhoraji                1.220940
           Sharfabad              0.643437
           Tariq Road             0.658947
           Defence                0.195602
lahore     Gulberg                0.386795
           Iqbal Road            -1.322021
           Model Town             0.980717
Islamabad  F-9                    0.000376
Peshawar   Khyber                -0.103039
           Qissa Khuwani Bazar   -0.463348
dtype: float64

In [51]:
df['Karachi']

Dhoraji       1.220940
Sharfabad     0.643437
Tariq Road    0.658947
Defence       0.195602
dtype: float64

In [55]:
a=df['Karachi']

In [60]:
a.iloc[1:4]

Sharfabad     0.643437
Tariq Road    0.658947
Defence       0.195602
dtype: float64

In [61]:
df.unstack().stack()

Islamabad  F-9                    0.000376
Karachi    Defence                0.195602
           Dhoraji                1.220940
           Sharfabad              0.643437
           Tariq Road             0.658947
Peshawar   Khyber                -0.103039
           Qissa Khuwani Bazar   -0.463348
lahore     Gulberg                0.386795
           Iqbal Road            -1.322021
           Model Town             0.980717
dtype: float64

In [67]:
df.index.names=['CITY','AREA']

In [68]:
df

CITY       AREA
Karachi    Dhoraji                1.220940
           Sharfabad              0.643437
           Tariq Road             0.658947
           Defence                0.195602
lahore     Gulberg                0.386795
           Iqbal Road            -1.322021
           Model Town             0.980717
Islamabad  F-9                    0.000376
Peshawar   Khyber                -0.103039
           Qissa Khuwani Bazar   -0.463348
dtype: float64

In [73]:
df.swaplevel('CITY','AREA')

AREA                 CITY
Dhoraji              Karachi      1.220940
Sharfabad            Karachi      0.643437
Tariq Road           Karachi      0.658947
Defence              Karachi      0.195602
Gulberg              lahore       0.386795
Iqbal Road           lahore      -1.322021
Model Town           lahore       0.980717
F-9                  Islamabad    0.000376
Khyber               Peshawar    -0.103039
Qissa Khuwani Bazar  Peshawar    -0.463348
dtype: float64